In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("encoding_practice_dataset.csv")

In [4]:
df

,user_id,gender,education_level,job_role,city,marital_status,device_type,subscription_plan,payment_method,monthly_income,tenure_months,churn
0,U1,Male,High School,Sales,City_38,Divorced,Mobile,Standard,Wallet,37784,24,0
1,U2,Female,Bachelor,Doctor,City_18,Married,Tablet,Standard,UPI,127167,27,0
2,U3,Female,Master,Sales,City_26,Married,Tablet,Free,Cash,82359,37,1
3,U4,Female,Bachelor,Consultant,City_6,Widowed,Mobile,Standard,Wallet,93608,39,0
4,U5,Male,Master,HR,City_4,Divorced,Laptop,Premium,Net Banking,30111,63,0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,U996,Male,Bachelor,Technician,City_11,Divorced,Mobile,Standard,Net Banking,134694,56,0
996,U997,Female,PhD,Teacher,City_32,Divorced,Tablet,Standard,Credit Card,147631,59,0
997,U998,Male,High School,Doctor,City_11,Single,Mobile,Free,Cash,65893,63,0
998,U999,Female,High School,Sales,City_18,Single,Mobile,Basic,Net Banking,30167,59,1
999,U1000,Male,Diploma,Sales,City_27,Married,Tablet,Free,Wallet,53598,51,1

In [5]:
# Convert the categorical 'gender' column into dummy/indicator variables (one-hot encoding)
# dtype=int ensures the resulting columns contain integers instead of booleans
# drop_first=True removes the first category(the original column gets deleted) to avoid multicollinearity in modeling
encoded_df = pd.get_dummies(df, columns=['gender'], dtype=int, drop_first=True)

In [6]:
encoded_df
#final encoded dataset

,user_id,education_level,job_role,city,marital_status,device_type,subscription_plan,payment_method,monthly_income,tenure_months,churn,gender_Male,gender_Other
0,U1,High School,Sales,City_38,Divorced,Mobile,Standard,Wallet,37784,24,0,1,0
1,U2,Bachelor,Doctor,City_18,Married,Tablet,Standard,UPI,127167,27,0,0,0
2,U3,Master,Sales,City_26,Married,Tablet,Free,Cash,82359,37,1,0,0
3,U4,Bachelor,Consultant,City_6,Widowed,Mobile,Standard,Wallet,93608,39,0,0,0
4,U5,Master,HR,City_4,Divorced,Laptop,Premium,Net Banking,30111,63,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,U996,Bachelor,Technician,City_11,Divorced,Mobile,Standard,Net Banking,134694,56,0,1,0
996,U997,PhD,Teacher,City_32,Divorced,Tablet,Standard,Credit Card,147631,59,0,0,0
997,U998,High School,Doctor,City_11,Single,Mobile,Free,Cash,65893,63,0,1,0
998,U999,High School,Sales,City_18,Single,Mobile,Basic,Net Banking,30167,59,1,0,0
999,U1000,Diploma,Sales,City_27,Married,Tablet,Free,Wallet,53598,51,1,1,0

In [7]:
#here encoding_df_1 means encdoing is being one on already encoded dataframe encoded_df .
# Apply one-hot encoding to the 'marital_status' column in the encoded_df dataframe
# - columns=['marital_status']: Specifies which column to encode in encoded_df
# - dtype=int: Ensures the resulting dummy columns contain integer values (0 or 1)
# - drop_first=True: Removes the first category to avoid multicollinearity 
# The result is stored in a new dataframe called encoded_df_1
encoded_df_1 = pd.get_dummies(encoded_df, columns=['marital_status'], dtype=int, drop_first=True)

In [10]:
encoded_df_1

,user_id,education_level,job_role,city,device_type,subscription_plan,payment_method,monthly_income,tenure_months,churn,gender_Male,gender_Other,marital_status_Married,marital_status_Single,marital_status_Widowed
0,U1,High School,Sales,City_38,Mobile,Standard,Wallet,37784,24,0,1,0,0,0,0
1,U2,Bachelor,Doctor,City_18,Tablet,Standard,UPI,127167,27,0,0,0,1,0,0
2,U3,Master,Sales,City_26,Tablet,Free,Cash,82359,37,1,0,0,1,0,0
3,U4,Bachelor,Consultant,City_6,Mobile,Standard,Wallet,93608,39,0,0,0,0,0,1
4,U5,Master,HR,City_4,Laptop,Premium,Net Banking,30111,63,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,U996,Bachelor,Technician,City_11,Mobile,Standard,Net Banking,134694,56,0,1,0,0,0,0
996,U997,PhD,Teacher,City_32,Tablet,Standard,Credit Card,147631,59,0,0,0,0,0,0
997,U998,High School,Doctor,City_11,Mobile,Free,Cash,65893,63,0,1,0,0,1,0
998,U999,High School,Sales,City_18,Mobile,Basic,Net Banking,30167,59,1,0,0,0,1,0
999,U1000,Diploma,Sales,City_27,Tablet,Free,Wallet,53598,51,1,1,0,1,0,0

In [11]:
# Apply one-hot encoding to multiple categorical columns in encoded_df_1
# - columns=['subscription_plan', 'payment_method', 'device_type']: Specifies which columns to encode
# - dtype=int: Ensures the resulting dummy columns contain integer values (0 or 1)
# - drop_first=True: Removes the first category from each column to avoid multicollinearity
# The result is stored in a new dataframe called encoded_df_2

encoded_df_2 = pd.get_dummies(encoded_df_1, columns=['subscription_plan', 'payment_method', 'device_type'], dtype=int, drop_first=True)

In [24]:
encoded_df_2

,user_id,education_level,job_role,city,monthly_income,tenure_months,churn,gender_Male,gender_Other,marital_status_Married,...,subscription_plan_Free,subscription_plan_Premium,subscription_plan_Standard,payment_method_Credit Card,payment_method_Debit Card,payment_method_Net Banking,payment_method_UPI,payment_method_Wallet,device_type_Mobile,device_type_Tablet
0,U1,High School,Sales,City_38,37784,24,0,1,0,0,...,0,0,1,0,0,0,0,1,1,0
1,U2,Bachelor,Doctor,City_18,127167,27,0,0,0,1,...,0,0,1,0,0,0,1,0,0,1
2,U3,Master,Sales,City_26,82359,37,1,0,0,1,...,1,0,0,0,0,0,0,0,0,1
3,U4,Bachelor,Consultant,City_6,93608,39,0,0,0,0,...,0,0,1,0,0,0,0,1,1,0
4,U5,Master,HR,City_4,30111,63,0,1,0,0,...,0,1,0,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,U996,Bachelor,Technician,City_11,134694,56,0,1,0,0,...,0,0,1,0,0,1,0,0,1,0
996,U997,PhD,Teacher,City_32,147631,59,0,0,0,0,...,0,0,1,1,0,0,0,0,0,1
997,U998,High School,Doctor,City_11,65893,63,0,1,0,0,...,1,0,0,0,0,0,0,0,1,0
998,U999,High School,Sales,City_18,30167,59,1,0,0,0,...,0,0,0,0,0,1,0,0,1,0
999,U1000,Diploma,Sales,City_27,53598,51,1,1,0,1,...,1,0,0,0,0,0,0,1,0,1